tutorials/surfaceTracking/interTrackFoam/ramp/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           volVectorField;
    location        "0";
    object          U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [0 1 -1 0 0 0 0];

internalField       uniform (6 0 0);

referenceLevel      (0 0 0);

boundaryField
{
    walls
    {
//         type slip;
        type fixedValue;
        value uniform (0 0 0);
    }

    freeSurface
    {
        type fixedGradient;
        gradient uniform (0 0 0);
    }

    outlet
    {
        type zeroGradient;
    }

    inlet
    {
        type fixedValue;
        value uniform (6 0 0);
    }

    frontAndBack
    {
        type empty;
    }   
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
