tutorials/surfaceTracking/interTrackFoam/ramp/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           volScalarField;
    location        "0";
    object          p;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions          [1 -1 -2 0 0 0 0];

internalField       uniform 0;

boundaryField
{
    walls
    {
        type zeroGradient;
    }

    freeSurface
    {
        type fixedValue;
        value uniform 0.0;
    }

    outlet
    {
        type zeroGradient;
    }

    inlet
    {
        type zeroGradient;
    }

    frontAndBack
    {
        type empty;
    }   
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
