tutorials/surfaceTracking/interTrackFoam/ramp/system/faSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        "system";
    object          faSchemes;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
}

gradSchemes
{
    default none;
    grad(Us) Gauss linear;
}

divSchemes
{
    default none;
    div(Us) Gauss linear;
}

laplacianSchemes
{
}

interpolationSchemes
{
}

snGradSchemes
{
}

fluxRequired
{
}


// ************************************************************************* //
